<?php

namespace App\\Support;

class IranianBankOptions
{
    public static function all(): array
    {
        return [
            'بانک ملی ایران',
            'بانک سپه',
            'بانک تجارت',
            'بانک ملت',
            'بانک صادرات ایران',
            'بانک مسکن',
            'بانک کشاورزی',
            'بانک رفاه کارگران',
            'بانک توسعه صادرات ایران',
            'بانک صنعت و معدن',
            'بانک توسعه تعاون',
            'پست بانک ایران',
            'بانک پارسیان',
            'بانک پاسارگاد',
            'بانک سامان',
            'بانک اقتصاد نوین',
            'بانک سرمایه',
            'بانک شهر',
            'بانک دی',
            'بانک کارآفرین',
            'بانک گردشگری',
            'بانک ایران زمین',
            'بانک خاورمیانه',
            'بانک سینا',
            'بانک قرض‌الحسنه مهر ایران',
            'بانک قرض‌الحسنه رسالت',
        ];
    }
}
